ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_outputxbar_regs.xml
		<register id="OUTPUTXBARG2SEL" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="OUTPUTXBAR G2 Input Select">
			<bitfield id="INPUT0" description="Select bit for INPUT0" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="INPUT1" description="Select bit for INPUT1" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="INPUT2" description="Select bit for INPUT2" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="INPUT3" description="Select bit for INPUT3" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="INPUT4" description="Select bit for INPUT4" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="INPUT5" description="Select bit for INPUT5" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="INPUT6" description="Select bit for INPUT6" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="INPUT7" description="Select bit for INPUT7" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="INPUT8" description="Select bit for INPUT8" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="INPUT9" description="Select bit for INPUT9" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="INPUT10" description="Select bit for INPUT10" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="INPUT11" description="Select bit for INPUT11" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="INPUT12" description="Select bit for INPUT12" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="INPUT13" description="Select bit for INPUT13" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="INPUT14" description="Select bit for INPUT14" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="INPUT15" description="Select bit for INPUT15" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="INPUT16" description="Select bit for INPUT16" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="INPUT17" description="Select bit for INPUT17" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="INPUT18" description="Select bit for INPUT18" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="INPUT19" description="Select bit for INPUT19" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="INPUT20" description="Select bit for INPUT20" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="INPUT21" description="Select bit for INPUT21" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="INPUT22" description="Select bit for INPUT22" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="INPUT23" description="Select bit for INPUT23" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="INPUT24" description="Select bit for INPUT24" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="INPUT25" description="Select bit for INPUT25" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="INPUT26" description="Select bit for INPUT26" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="INPUT27" description="Select bit for INPUT27" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="INPUT28" description="Select bit for INPUT28" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="INPUT29" description="Select bit for INPUT29" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="INPUT30" description="Select bit for INPUT30" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="INPUT31" description="Select bit for INPUT31" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
		<register id="OUTPUTXBARG3SEL" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="OUTPUTXBAR G3 Input Select">
			<bitfield id="INPUT0" description="Select bit for INPUT0" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="INPUT1" description="Select bit for INPUT1" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="INPUT2" description="Select bit for INPUT2" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="INPUT3" description="Select bit for INPUT3" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="INPUT4" description="Select bit for INPUT4" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="INPUT5" description="Select bit for INPUT5" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="INPUT6" description="Select bit for INPUT6" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="INPUT7" description="Select bit for INPUT7" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="INPUT8" description="Select bit for INPUT8" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="INPUT9" description="Select bit for INPUT9" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="INPUT10" description="Select bit for INPUT10" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="INPUT11" description="Select bit for INPUT11" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="INPUT12" description="Select bit for INPUT12" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="INPUT13" description="Select bit for INPUT13" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="INPUT14" description="Select bit for INPUT14" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="INPUT15" description="Select bit for INPUT15" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="INPUT16" description="Select bit for INPUT16" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="INPUT17" description="Select bit for INPUT17" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="INPUT18" description="Select bit for INPUT18" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="INPUT19" description="Select bit for INPUT19" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="INPUT20" description="Select bit for INPUT20" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="INPUT21" description="Select bit for INPUT21" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="INPUT22" description="Select bit for INPUT22" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="INPUT23" description="Select bit for INPUT23" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="INPUT24" description="Select bit for INPUT24" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="INPUT25" description="Select bit for INPUT25" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="INPUT26" description="Select bit for INPUT26" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="INPUT27" description="Select bit for INPUT27" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="INPUT28" description="Select bit for INPUT28" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="INPUT29" description="Select bit for INPUT29" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="INPUT30" description="Select bit for INPUT30" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="INPUT31" description="Select bit for INPUT31" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
